ahung1407/STM32LAB/lab4_scheduler/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define but1_Pin GPIO_PIN_13
#define but1_GPIO_Port GPIOC
#define but2_Pin GPIO_PIN_14
#define but2_GPIO_Port GPIOC
#define RED_1_Pin GPIO_PIN_0
#define RED_1_GPIO_Port GPIOA
#define YELLOW_1_Pin GPIO_PIN_1
#define YELLOW_1_GPIO_Port GPIOA
#define GREEN_1_Pin GPIO_PIN_2
#define GREEN_1_GPIO_Port GPIOA
#define RED_2_Pin GPIO_PIN_3
#define RED_2_GPIO_Port GPIOA
#define YELLOW_2_Pin GPIO_PIN_4
#define YELLOW_2_GPIO_Port GPIOA
#define GREEN_2_Pin GPIO_PIN_5
#define GREEN_2_GPIO_Port GPIOA
#define LED_RED_Pin GPIO_PIN_7
#define LED_RED_GPIO_Port GPIOA
#define En1_Pin GPIO_PIN_0
#define En1_GPIO_Port GPIOB
#define En2_Pin GPIO_PIN_1
#define En2_GPIO_Port GPIOB
#define En3_Pin GPIO_PIN_2
#define En3_GPIO_Port GPIOB
#define but3_Pin GPIO_PIN_11
#define but3_GPIO_Port GPIOB
#define D0_Pin GPIO_PIN_8
#define D0_GPIO_Port GPIOA
#define D1_Pin GPIO_PIN_9
#define D1_GPIO_Port GPIOA
#define D2_Pin GPIO_PIN_10
#define D2_GPIO_Port GPIOA
#define D3_Pin GPIO_PIN_11
#define D3_GPIO_Port GPIOA
#define D4_Pin GPIO_PIN_12
#define D4_GPIO_Port GPIOA
#define D5_Pin GPIO_PIN_13
#define D5_GPIO_Port GPIOA
#define D6_Pin GPIO_PIN_14
#define D6_GPIO_Port GPIOA
#define En4_Pin GPIO_PIN_3
#define En4_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
